# StairsSupportVerticalOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsSupportVerticalOffset Property
ParameterTypeId Class See Also
---
"Vertical Offset": Distance of top plane of edge stringer relative to the plane connecting tread nosing
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsSupportVerticalOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSupportVerticalOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsSupportVerticalOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace